//  ІМПОРТ за замовчуванням (дефолтний) :

import sum from "./helpers"   //    "sum" — локальна змінна, в яку імпортується значення. "sum" - значення за замовчуванням (default - "за замовчуванням"). Ім'я, з яким імпортується значення за замовчуванням, може бути вибрано довільним чином. Наприклад :
import testSum1 from "./helpers";
import testSum2 from "./helpers";


// Виходить, що можна зробити скільки завгодно імпортів одного й того ж дефолтного експорту з різними іменами :

console.log(testSum1(5, 5));   //   10
console.log(testSum2(20, 3));   //   23
