// ПОЯСНЕННЯ-21   ІМПОРТ функції "sum" для різних файлів page-2.js і main.js  (01:36:00)
//  ІМПОРТ за замовчуванням (дефолтний) :


// import sum from "./helpers"   //    "sum" — локальна змінна, в яку імпортується значення. "sum" - значення за замовчуванням (default - "за замовчуванням"). Ім'я, з яким імпортується значення за замовчуванням, може бути вибрано довільним чином. Наприклад :
// import testSum1 from "./helpers";
// import testSum2 from "./helpers";


// // Виходить, що можна зробити скільки завгодно імпортів одного й того ж дефолтного експорту з різними іменами :

// console.log(testSum1(5, 5));   //   10
// console.log(testSum2(20, 3));   //   23



// .............................
// .............................


// ПОЯСНЕННЯ-22    ІМЕНОВАНІ експорт та імпорт (named export).   (01:47:10)

//........

// import sum from "./helpers"                         //    ІМПОРТ за замовчуванням (дефолтний)
// import { sayHello, userName } from "./helpers"      //    ІМПОРТ іменований

//........


// або ЗАГАЛЬНИЙ ІМПОРТ :

import sum, { sayHello, userName } from "./helpers"

console.log(sum(7, 5));  //  12


sayHello();              //  hello
console.log(userName);   //  Alice


